module.exports = {
	// Сообщение при входе в дж
	DungeonInfo : [
		{zone: 9066, string: 'Вы вошли в <font color="#56B4E9">Рулетка Демороса</font>'},
		{zone: 9059, string: 'Вы вошли в <font color="#56B4E9">Остров Мертвых</font> <font color="#E69F00">Нормал</font>'},
		{zone: 9759, string: 'Вы вошли в <font color="#56B4E9">Остров Мертвых</font> <font color="#00FFFF">Хард</font>'},
		{zone: 9767, string: 'Вы вошли в <font color="#56B4E9">Лаборатория Берна</font> <font color="#E69F00">Нормал</font>'},
		{zone: 9067, string: 'Вы вошли в <font color="#56B4E9">Лаборатория Берна</font> <font color="#00FFFF">Хард</font>'},
		{zone: 9770, string: 'Вы вошли в <font color="#56B4E9">Руины Абнукты</font> <font color="#E69F00">Нормал</font>'},
		{zone: 9970, string: 'Вы вошли в <font color="#56B4E9">Руины Абнукты</font> <font color="#00FFFF">Хард</font>'},
		{zone: 9781, string: 'Вы вошли в <font color="#56B4E9">Святилище Велики</font> <font color="#E69F00">Нормал</font>'},
		{zone: 9981, string: 'Вы вошли в <font color="#56B4E9">Святилище Велики</font> <font color="#00FFFF">Хард</font>'},
		{zone: 9735, string: 'Вы вошли в <font color="#56B4E9">RK-9</font> <font color="#E69F00">Нормал</font>'},
		{zone: 9935, string: 'Вы вошли в <font color="#56B4E9">RK-9</font> <font color="#00FFFF">Хард</font>'},
		{zone: 9739, string: 'Вы вошли в <font color="#56B4E9">Лагерь повстанцев</font> <font color="#E69F00">Нормал</font>'},
		{zone: 9939, string: 'Вы вошли в <font color="#56B4E9">Лагерь повстанцев</font> <font color="#00FFFF">Хард</font>'},
		{zone: 9720, string: 'Вы вошли в <font color="#56B4E9">Омут Антароса</font> <font color="#E69F00">Нормал</font>'},
		{zone: 9920, string: 'Вы вошли в <font color="#56B4E9">Омут Антароса</font> <font color="#00FFFF">Хард</font>'},
		{zone: 3017, string: 'Вы вошли в <font color="#56B4E9">Омут Антароса</font> <font color="#FF0000"> Рейд</font>'},
		{zone: 9783, string: 'Вы вошли в <font color="#56B4E9">Крепость Тенебриса</font> <font color="#E69F00">Нормал</font>'},
		{zone: 9983, string: 'Вы вошли в <font color="#56B4E9">Крепость Тенебриса</font> <font color="#00FFFF">Хард</font>'},
		{zone: 3018, string: 'Вы вошли в <font color="#56B4E9">Крепость Тенебриса</font> <font color="#FF0000"> Рейд</font>'},
		{zone: 9782, string: 'Вы вошли в <font color="#56B4E9">Мастерская Леандра</font> <font color="#E69F00">Нормал</font>'},
		{zone: 9982, string: 'Вы вошли в <font color="#56B4E9">Мастерская Леандра</font> <font color="#00FFFF">Хард</font>'},
		{zone: 3019, string: 'Вы вошли в <font color="#56B4E9">Мастерская Леандра</font> <font color="#FF0000"> Рейд</font>'},
		{zone: 3101, string: 'Вы вошли в <font color="#56B4E9">Гнездо Паркин</font> <font color="#E69F00">Нормал</font>'},
		{zone: 3201, string: 'Вы вошли в <font color="#56B4E9">Гнездо Паркин</font> <font color="#00FFFF">Хард</font>'},
		{zone: 3023, string: 'Вы вошли в <font color="#56B4E9">Крепость Берарка</font>'},
		{zone: 3020, string: 'Вы вошли в <font color="#56B4E9">Золотая чешуя</font>'},
		{zone: 3026, string: 'Вы вошли в <font color="#56B4E9">Келасаик</font> <font color="#E69F00">Нормал</font>'},
		{zone: 3126, string: 'Вы вошли в <font color="#56B4E9">Келсаик</font> <font color="#00FFFF">Хард</font>'},
		{zone: 3027, string: 'Вы вошли в <font color="#56B4E9">狂气竞技场</font>'}
	],
	// Рулетка Демороса
	DW_BOSS_1 : [
		{id: 105, msg: 'Прыжок (Стан)'},
		{id: 106, msg: '尾气后喷'},
		{id: 109, msg: '前砸(坦)'},
		{id: 110, msg: '甩尾(中毒)'},
		// > 50%
		{id: 306, msg: '+1кольцо'},
		{id: 307, msg: '+2кольца'},
		{id: 308, msg: '+3кольца'},
		{id: 309, msg: '+4кольца'},
		{id: 310, msg: '+5колец'},
		// < 50%
		{id: 319, msg: '+1кольцо'},
		{id: 320, msg: '+2кольца'},
		{id: 321, msg: '+3кольца'},
		{id: 322, msg: '+4кольца'},
		{id: 323, msg: '+5колец'},
		// 鉴定 - 计算总圈数(双数为蓝/单数为红)
		{id: 311, msg: '↓ От ↓'}, // 王-Красный бафф
		{id: 315, msg: '↓ От ↓'}, // 王-Красный бафф
		{id: 313, msg: '↓ От ↓'}, // 王-Синий бафф
		{id: 317, msg: '↓ От ↓'}, // 王-Синий бафф
		// 相同进圈 不同出圈
		{id: 312, msg: '↑ К ↑'}, // 王-Красный бафф
		{id: 316, msg: '↑ К ↑'}, // 王-Красный бафф
		{id: 314, msg: '↑ К ↑'}, // 王-Синий бафф
		{id: 318, msg: '↑ К ↑'}  // 王-Синий бафф	
	],
	DW_TipMsg1: ["双(蓝)", "单(红)"],
	DW_BOSS_2 : [
		{id: 113, msg: '激光!!'},
		{id: 116, msg: '拉人(群体)'},
		// 217 蓝圈 - 1次伤害
		{id: 223, msg: '红圈 - 2次伤害'},
		{id: 303, msg: '打投掷'},
		{id: 309, msg: '进场 | 王举(蓝)球时 进圈'},
		{id: 310, msg: '进场 | 王举(红)球时 进圈'},
		// 王举(蓝)球
		{id: 311, msg: '↑ 进圈(蓝) ↑'},
		{id: 313, msg: '↓ 出圈(蓝) ↓'},
		// 王举(红)球
		{id: 314, msg: '↑ 进圈(红) ↑'},
		{id: 312, msg: '↓ 出圈(红) ↓'}	
	],
	DW_TipMsg2: [
		"Next -> ",
		"红(顺) | (蓝+白)", "白(顺) | (红+蓝)", "蓝(顺) | (红+白)", // 466050   466051   466052
		"全部!!",
		"红(逆)",           "白(逆)",           "蓝(逆)"            // 466054   466055   466056
	],
	// Остров Мертвых
	FI_BOSS_1 : [
		{id: 1104, msg: 'Прыжок(Стан)'},
		{id: 2104, msg: 'Прыжок(Стан)'},
		{id: 1106, msg: 'Крутилка'},
		{id: 2106, msg: 'Крутилка'},
		{id: 3107, msg: 'Эвейд'}
		// 3111 Проклятье
		// 3106 鉴定-Взрыв наружнего кольца
		// 3101 鉴定-Взрыв внутреннего кольца
	],
	FI_BOSS_2 : [
		{id: 3101, msg: 'Откид'},
		{id: 3102, msg: 'Круги x5(Эвейд)'},
		{id: 3104, msg: 'АОЕ!!'},
		{id: 3105, msg: 'Стяжка | Откид'},
		{id: 3107, msg: 'Круг x1 (Эвейд)'}
	],
	FI_BOSS_3 : [
		{id: 1101, msg: '- Распространение -'},
		{id: 2101, msg: '- Распространение -'},
		{id: 1102, msg: '- Стяжка -'},
		{id: 2102, msg: '- Стяжка -'},
		/* 
		{id: 1106, msg: 'Ковёр'}, // Переднии
		{id: 2106, msg: 'Ковёр'},
		{id: 1107, msg: 'Ковёр'}, // Заднии
		{id: 2107, msg: 'Ковёр'},
		{id: 1108, msg: 'Ковёр'}, // Правые
		{id: 2108, msg: 'Ковёр'},
		{id: 1109, msg: 'Ковёр'}, // Левые
		{id: 2109, msg: 'Ковёр'},
		 */
		{id: 1110, msg: '  Молния  '},
		{id: 2110, msg: '  Молния  '},
		
		{id: 3105, msg: 'Эвейд'},
		{id: 3108, msg: 'Проклятье x2'},
		{id: 3109, msg: 'Ковер'}
	],
	FI_TipMsg : ["Проклятье | Внутренее | внешнее кольцо", "Проклятье x2", "Лазер!!!"],
	// Лаборатория Берна
	DF_BOSS_1 : [
		
	],
	DF_BOSS_2 : [
		
	],
	DF_BOSS_3 : [
		{id: 205, msg: 'Откид(Медленно)'},
		{id: 218, msg: 'Откид'},
		{id: 211, msg: 'От дерева'},
		{id: 212, msg: 'От стен'},
		{id: 219, msg: 'От дерева | От стен'}
	],
	// Руины Абнукты
	RM_BOSS_1 : [
		{id: 107, msg: 'Задувка'}
	],
	RM_BOSS_2 : [
		{id: 106, msg: 'Стан'},
		{id: 111, msg: 'Проходка'}
	],
	RM_BOSS_3 : [
		// 102 101 103          后喷
		{id: 103, msg: 'Хвост'},
		// 101 102 104 105     不推
		// 101 102 104 106 107 推坦
		{id: 106, msg: 'Откид вперед'},
		{id: 110, msg: 'Прокрутка (эвейд)!!!'}, // 108 110 111
		// 317 分散吃球
		// 319 分散吃球 愤怒
		{id: 113, msg: '  От  '}, // 113  114 115
		{id: 116, msg: '  К  '}, // 116  117 118
		// < 30% 
		{id: 311, msg: 'Взрыв (за спину)!!!'},
		{id: 322, msg: 'Циркуль!!(Регрес)'}
	],
	// Святилище Велики
	VS_BOSS_1 : [
		{id: 301, msg: 'Сало'},
		{id: 304, msg: 'Прочь'},
		{id: 401, msg: 'Слева', msg_tk: 'Справа', sign_degrees: 270},
		{id: 402, msg: 'Справа', msg_tk: 'Слева', sign_degrees:  90}
	],
	VS_BOSS_2 : [
		{id: 106, msg: '  Назад   '},
		{id: 108, msg: '  Вперед  '},
		{id: 131, msg: 'Слева', msg_tk: 'Справа', sign_degrees: 270},
		{id: 130, msg: 'Справа', msg_tk: 'Слева', sign_degrees:  90},
		{id: 134, msg: 'Дебафф'}
	],
	VS_BOSS_3 : [
		{id: 116, msg: 'Конус вперед', msg2: 'Бублики(подлет)'},
		{id: 138, msg: 'Убирайся!!'},
		{id: 144, msg: '  От  '},
		{id: 145, msg: '  К  '},
		// 149 前刺(坦)
		{id: 151, msg: 'Стан | Когти'},
		{id: 152, msg: 'Стан | Назад'},
		{id: 701, msg: 'Назад (Откид) | Выпад(Уронение)'},
		{id: 103, msg: 'Круги (Разбежаться)'},
		{id: 301, msg: 'Бомба (Вместе) | Клинс'},
		{id: 404, msg: 'Дебафф (Рядом)'},
		{id: 105, msg: 'Круги (Вместе)'},
		{id: 302, msg: 'Бомба (Вместе) | Без клинса'},
		{id: 405, msg: 'Дебафф (Далеко)'},
		{id: 401, msg: 'Регресс!!'},
		{id: 402, msg: 'Слип!!'}
	],
	//            0           1           2           3           1+3=4       2+3=5       3+3=6
	VS_TipMsg : ["Next -> ", "Дебафф (рядом x2)", "Круги (Разбежаться)", "Бомба(Клинс)", "Бебафф (далеко x2)", "Круги (вместе)", "Бомба (Без клинса)"],
	// Ангар RK-9
	RK_BOSS_1 : [
		{id: 104, msg: '- Ролики(Стан) -'},
		{id: 112, msg: '  Удар назад  '},
		{id: 304, msg: 'Взрыв внутреннего кольца!!'},
		{id: 305, msg: 'Взрыв внешнего кольца!!'},
		{id: 306, msg: 'Бомбы!!!'},
		{id: 307, msg: 'Стяжка'},
		{id: 309, msg: 'Прыгай!!!'},
		// 上级披萨鉴定
		{id: 315, msg: ' Справа спереди'}, // 1
		{id: 319, msg: ' Справа спереди'},
		{id: 311, msg: ' Верхний правый'}, // 2
		{id: 323, msg: ' Верхний правый'},
		{id: 312, msg: ' Справа внизу'}, // 3
		{id: 324, msg: ' Справа внизу'},
		{id: 316, msg: ' Сзади справа'}, // 4
		{id: 320, msg: ' Сзади справа'},
		{id: 313, msg: ' Сзади слева'}, // 5
		{id: 321, msg: ' Сзади слева'},
		{id: 317, msg: ' Левый нижний'}, // 6
		{id: 325, msg: ' Левый нижний'},
		{id: 318, msg: ' Верхний левый'}, // 7
		{id: 322, msg: ' Верхний левый'},
		{id: 314, msg: ' Передний левый'}, // 8
		{id: 326, msg: ' Передний левый'}
	],
	RK_BOSS_2 : [
		{id: 102, msg: 'Пила(Эвейд)'},
		{id: 108, msg: 'Откид назад'},
		{id: 105, msg: 'Крутилка (откид)'},
		// 上级
		{id: 305, msg: 'К | От'},
		{id: 304, msg: 'От!!'}
	],
	RK_BOSS_3 : [
		{id: 117, msg: 'Слева', msg_tk: 'Слева'}, // 117 121 123
		{id: 118, msg: 'Слева', msg_tk: 'Слева'}, // 118 121 123
		{id: 116, msg: 'Справа', msg_tk: 'Справа'}, // 116 120 122
		{id: 119, msg: 'Справа', msg_tk: 'Справа'}, // 119 120 122
		{id: 128, msg: 'Комба | Конус назад'},
		// 128 129 火箭拳 | 130 131 后喷
		{id: 321, msg: 'Щит!!!'},
		{id: 323, msg: 'Проверка!!!'},
		{id: 324, msg: 'Эвейд (стан)'}
		// 305 鉴定
	],
	RK_TipMsg : ["Next -> ", "От", "К", "Волна", "Щит через 10сек"],
	// Лагерь повстанцев
	RR_BOSS_1 : [
	
	],
	RR_BOSS_2 : [
		{id: 119, msg: 'Конус вперед'},
		{id: 120, msg: 'Конус назад'}
	],
	RR_BOSS_3 : [
		{id: 115, msg: 'Рёв (Стан)!!'},
		{id: 175, msg: 'Истина·怒吼(Стан)'},
		{id: 201, msg: 'Истинное лицо(Эвейд)'}
	],
	// Омут Антароса
	AA_BOSS_1 : [
		{id: 116, msg: '  От  '},
		{id: 117, msg: '  К  '},
		{id: 300, msg: '~Подлет (эвейд)~'}
	],
	AA_BOSS_2 : [
		{id: 119, msg: 'Дебафф!!'}
	],
	AA_BOSS_3 : [
		{id: 104, msg: 'Стан назад'},
		{id: 113, msg: 'Вперед | Назад (Стан)'},
		{id: 202, msg: 'Отпрыжка | Крутилка'},
		{id: 109, msg: 'Слева безопасно', msg_tk: 'Справа', sign_degrees: 270},
		{id: 111, msg: 'Справа', msg_tk: 'Слева', sign_degrees:  90},
		{id: 310, msg: 'Волна'},
		{id: 311, msg: 'Волна'},
		{id: 312, msg: 'Волна'},
		{id: 313, msg: 'Волна'},
		{id: 314, msg: 'Волна'},
		{id: 400, msg: 'Полоса х3'}, // 三幻影-剑气 205 500 400 204 204
		{id: 401, msg: 'Крутилка х3'}  // 三幻影-转圈 205 500 401 115 309
	],
	// Крепость Тенебриса
	DRC_BOSS_1 : [
		{id: 108, msg: 'Эвейд'},
		{id: 109, msg: 'Удар назад (откид)'},
		{id: 119, msg: 'АОЕ'},
		{id: 127, msg: 'Молния!!'}
	],
	DRC_BOSS_2 : [
		{id: 105, msg: 'Плеть (Эвейд)'},
		{id: 110, msg: 'Удар вперед(эвейд)'},
		{id: 111, msg: 'Правая нога'},
		{id: 115, msg: 'Левая нога'},
		{id: 119, msg: 'Эвейд'},
		{id: 120, msg: 'Вперед | Назад'},
		{id: 316, msg: 'Огненное АОЕ'},
		{id: 317, msg: 'Эвейд!!!(Вода)'},
		{id: 318, msg: 'Эвейд!!!(Трава)'}
	],
	DRC_BOSS_3 : [
		{id: 106, msg: 'Откид вперед'},
		{id: 109, msg: 'Эвейд'},
		{id: 112, msg: 'Откид назад'},
		{id: 301, msg: 'Эвейд(Шип)'},
		{id: 303, msg: 'Справа', sign_degrees1:  80, sign_degrees2: 260},
		{id: 306, msg: 'Слева', sign_degrees1: 100, sign_degrees2: 280},
		{id: 309, msg: 'Дебафф!!'},
		{id: 315, msg: 'Эвейд | Отойти'}
	],
	DRC_TipMsg : ["100% энергия!!"],
	// Мастерская Леандра
	GLS_BOSS_1 : [
		{id: 106, msg: 'Тяжелый удар'},
		{id: 107, msg: 'Откид (конус)'},
		{id: 109, msg: 'Камни(Малый)'},
		{id: 110, msg: 'Камни(Большой)'},
		{id: 116, msg: 'АОЕ!!'},
		{id: 301, msg: 'Оглушающие цветы'},
		{id: 307, msg: 'Клетка'},
		{id: 309, msg: '1 цветок!!!'},
		{id: 310, msg: '2 цветка!!!'},
		{id: 312, msg: 'Золотой цветок!!!'}
	],
	GLS_BOSS_2 : [
		{id: 105, msg: 'Кувырок'},
		{id: 113, msg: 'Стан'},
		{id: 114, msg: 'К'},
		{id: 116, msg: 'Вперед | Назад'},
		{id: 301, msg: '  От | Эвейд'},
		{id: 302, msg: '  К | Эвейд'}
	],
	GLS_BOSS_3 : [
		{id: 118, msg: 'Передняя комба'},
		{id: 143, msg: 'Слева сзади'},
		{id: 145, msg: 'Слева сзади'},
		{id: 146, msg: 'Слева сзади(Бублик)', sign_degrees: 325, sign_distance: 370},
		{id: 154, msg: 'Слева сзади(Бублик)', sign_degrees: 325, sign_distance: 370},
		{id: 144, msg: 'Справа сзади'},
		{id: 147, msg: 'Справа сзади'},
		{id: 148, msg: 'Справа сзади(Бублик)', sign_degrees: 25, sign_distance: 388},
		{id: 155, msg: 'Справа сзади(Бублик)', sign_degrees: 25, sign_distance: 388},
		{id: 161, msg: 'Назад | Вперед'},
		{id: 162, msg: 'Назад | Вперед'},
		{id: 213, msg: 'Хвост!!'},
		{id: 215, msg: 'Хвост!!'},
		{id: 139, msg: 'Слева безопасно', sign_degrees: 270}, //151
		{id: 150, msg: 'Слева безопасно', sign_degrees: 270}, //151
		{id: 141, msg: 'Справа безопасно', sign_degrees:  90}, //153
		{id: 152, msg: 'Справа безопасно', sign_degrees:  90}, //153
		{id: 300, msg: 'Эвейд(Пробуждение 1)', level_Msg: ['1!', '2!!', '3!!!', '<font color="#FF0000">Взрыв!!!!</font>']},
		{id: 399, msg: 'Эвейд(Пробуждение 2)', level_Msg: ['1!', '<font color="#FF0000">Взрыв!!</font>']},
		{id: 360, msg: 'Взрыв!! Взрыв!!'}
	],
	// Гнездо Паркин
	GV_BOSS_1 : [
		{id: 124, msg: 'Стан (фаст)'},
		{id: 104, msg: 'Стан'},
		{id: 133, msg: 'Прыжок (фаст)'},
		{id: 113, msg: 'Прыжок'},
		{id: 138, msg: 'Прыжок (фаст)'},
		{id: 118, msg: 'Прыжок'},
		// 147 向前连续攻击
		{id: 149, msg: 'Левая рука(подлет)'},
		{id: 148, msg: 'Правая рука(подлет)'},
		
		{id: 127, msg: '|Полоса| (фаст)'},
		{id: 107, msg: '|Полоса|'},
		{id: 131, msg: 'Волна назад (фаст)'},
		{id: 111, msg: 'Волна'},
		{id: 132, msg: '- лево + право - (фаст)'},
		{id: 112, msg: '- лево + право -'},
		{id: 139, msg: '| вперед + назад | (фаст)'},
		{id: 119, msg: '| вперед + назад |'},
		{id: 314, msg: 'Кольцо (фаст)'},
		{id: 313, msg: 'Кольцо'},
		
		{id: 305, msg: 'Pizza'}, // 143 / 145
		
		{id: 312, msg: 'Мёд (фаст)'},
		{id: 311, msg: 'Мёд'}
	],
	GV_BOSS_2 : [
		
		
		{id: 108, msg: 'Вперед | Назад'},
		{id: 228, msg: 'Камни (вместе)'},
		{id: 227, msg: 'Взрыв!!'},
		{id: 230, msg: 'АОЕ!!'},
		{id: 231, msg: '  От  '},
		{id: 232, msg: '  К  '},
		{id: 235, msg: 'Дебафф!!'},
		{id: 236, msg: 'Конус вперед (байт)'}
	],
	// Крепость Берарка
	AQ_BOSS_1 : [
		{id: 1104, msg: 'Прыжок + Стан'},
		{id: 2104, msg: 'Прыжок + Стан'},
		{id: 1110, msg: 'Передний стан'},
		{id: 2110, msg: 'Передний стан'},
		{id: 1111, msg: '| Левая полоса'},
		{id: 1113, msg: '| Левая полоса'}, // 1112 1113
		{id: 2111, msg: '| Левая полоса'},
		{id: 2113, msg: '| Левая полоса'}, // 2112 2113
		{id: 1112, msg: 'Правая полоса |'},
		{id: 1114, msg: 'Правая полоса |'}, // 1111 1114
		{id: 2112, msg: 'Правая полоса |'},
		{id: 2114, msg: 'Правая полоса |'}, // 2111 2114
		{id: 1115, msg: 'Руки'},
		{id: 2115, msg: 'Руки'},
		{id: 1116, msg: 'Взрыв (Кайя)!!!'}, // 1117
		{id: 2116, msg: 'Взрыв (Кайя)!!!'}, // 2117
		{id: 3107, msg: 'Конус вперед'},
		{id: 3115, msg: 'Крутилка'}, // 1106 2106
		{id: 3116, msg: 'Круги + Крутилка'}, // 1106 2106
		{id: 3119, msg: ' ', TIP: [" От ", " К "]}, // 红出 | 蓝进
		{id: 3220, msg: ' ', TIP: [" К ", " От "]}  // 红进 | 蓝出
	],
	AQ_BOSS_2 : [
		{id: 164, msg: 'Отпрыжка (Кровоток)'},
		{id: 166, msg: 'Обернуться'}, // 169 166 前搓 左购拳 右勾拳
		{id: 175, msg: 'Рёв (Эвейд)!!!'},
		{id: 181, msg: 'Полоса вперед'},
		// 214 полоса x3 181
		{id: 182, msg: 'Опрокид'}, // 183 184
		// 302 209 Топат(опрокид) 182 183 184
		{id: 185, msg: 'Взрыв (Кайя)!!'},
		{id: 202, msg: 'Назад + Вперед'},  // 177
		{id: 207, msg: 'Прыжки x5 (Кровоток)'}, // 204 206 205
		{id: 212, msg: 'Байт (Кровоток)'}    // 180
	],	
	// Золотая чешуя (Sailing Instance)
	SI_BOSS_1 : [
       		{id: 104, msg: 'Высасывание(Выйти)'}
	],
	SI_BOSS_2 : [
       		{id: 103, msg: 'Высасывание(выйти!!!)'}
	],
	SI_BOSS_3 : [
       		{id: 108, msg: 'Стан'},
		{id: 128, msg: 'Черкаш + подлет'},
		{id: 129, msg: 'Полоса в цель'},
		{id: 135, msg: "Волны х5"},
		{id: 204, msg: "30% видоизменение"},
		{id: 137, msg: 'Волна от'},
		{id: 139, msg: 'Волна к'},
		{id: 133, msg: 'Бублики (подлет)'},
		{id: 127, msg: '', TIP: ["От него", "К нему"]},
		
		{id: 121, msg: ''},         // '前砸(外) | 转圈(内)'(绿)_来吧  +No.1 buff
		{id: 122, msg: ''},         // '转圈(内) | 前砸(外)'(紫)_滚开  +No.1 buff
	//  {id: 124, msg: '前砸'},     // 第一击 / 第二击
	//  {id: 125, msg: '转圈'},     // 第一击 / 第二击		
        	{id: 123, msg: ''},         // '蓄力前砸 | ↓(外)↓'(绿)_爆炸  +No.2 buff
		{id: 120, msg: ''},         // '蓄力转圈 | ↑(内)↑'(紫)_深渊  +No.2 buff
	//  {id: 126, msg: '大前砸'},  // 第三击
	//  {id: 134, msg: '大转圈'},  // 第三击
	],
	//           121+120=241 122+120=242           121+123=244 122+123=245
	SI_TipMsg : ["От него-К нему-К нему", "К нему-От него-К нему","Эвейд!!!!!!", "От него-К нему-От него", "К нему-От него-От него"],
	// 凯尔赛克隐藏地(Corrupted Skynest)
	CK_BOSS : [
 		// 120 猛烈的咆哮
		// 162 猛烈的咆哮
		// 106 前方-驴打滚
		// 156 前方-驴打滚
		// 205 前方跳跃(回避)
		// 206 后方跳跃(闪避)
		// 131 广域1实例
		{id: 103, msg: '尾巴(击飞!!)'},
		{id: 153, msg: '尾巴(击飞!!)'},
		{id: 108, msg: '右转(击退!!)'},
		{id: 158, msg: '右转(击退!!)'},
		{id: 109, msg: '左转(击退!!)'},
		{id: 159, msg: '左转(击退!!)'},
		{id: 118, msg: '~我要飞得更高~'},
		{id: 160, msg: '~我要飞得更高~'},
		{id: 137, msg: '[暴走]凯克·赛克 积蓄力量'},
		{id: 138, msg: '大范围 击退!!'},
		{id: 110, msg: '火炎DOT(远离)'},
		{id: 112, msg: '冷气DOT(远离)'},
		{id: 114, msg: '前方 火坑DOT(远离)'},
		{id: 139, msg: '[温度] 60° 全体(火)'},
		{id: 140, msg: '[温度] 40° 全体(冰)'},
		// 164 [温度] 100° 全灭
		// 165 [温度] 0° 全灭
		// 切换DeBuff
		// 101 右脚(火_闪避)
		// 151 右脚(火_闪避)
		// 102 左脚(冰_格挡)
		// 152 左脚(冰_格挡)
		// 107 双脚_快
		// 157 双脚_快
		{id: 145, msg: '双脚_慢(眩晕)'},
		{id: 104, msg: 'AOE-寒冰魔法(大)'},
		{id: 154, msg: 'AOE-寒冰魔法(小)'},
		{id: 105, msg: 'AOE-火焰魔法(大)'},
		{id: 155, msg: 'AOE-火焰魔法(小)'},
		// 内外鉴定
		{id: 212, msg: '内火 '}, // 212 -> 141
		{id: 213, msg: '内冰 '}, // 213 -> 143
		{id: 214, msg: '内冰 '}, // 214 -> 142
		{id: 215, msg: '内火 '}, // 215 -> 144
	// 以下未知
		{id: 119, msg: '微弱的咆哮'},
		{id: 161, msg: '微弱的咆哮'},
		{id: 124, msg: '弱高空落下'},
		{id: 163, msg: '弱高空落下'},
		
		{id: 116, msg: '（火焰布雷斯用）活力四射'},// "(화염브레스용)액티브무브_Run_노멀"
		{id: 117, msg: '火焰布鲁斯'},// "화염브레스_breath_노멀"
		
		{id: 121, msg: '复活诅咒'},// "부활저주_SpwanNpc_노멀"
		{id: 122, msg: '召唤部下'},// "부하소환_reactionAtk_노멀"
		{id: 123, msg: '等待-磁增益法术'},// "자기버프_Wait_노멀"
		
		{id: 125, msg: '近身禁止 发动'},// "근거리금지_발동_SpawnNpc_노멀"
		{id: 126, msg: '远程禁止 发动'},// "원거리금지_발동_SpawnNpc_노멀"
		{id: 127, msg: '禁止恢复 发动'},// "회복금지_발동_SpawnNpc_노멀"
		{id: 128, msg: '近身禁止 结束'},// "근거리금지_종료_SpawnNpc_노멀"
		{id: 129, msg: '远程禁止 结束'},// "원거리금지_종료_SpawnNpc_노멀"
		{id: 130, msg: '禁止恢复 结束'},// "회복금지_종료_SpawnNpc_노멀"
		
		{id: 132, msg: '目标召唤(475)'},// "오브젝트소환(475)_aggrochange_노말"
		{id: 133, msg: '目标召唤(3026)'},// "오브젝트소환(3026)_aggrochange_노말"
		{id: 134, msg: '广域一人奴隶'},// "광역1인노예_aggrochange_노말"
		
		{id: 135, msg: '[暴走]凯克·萨克 强悍的咆哮'},// "[폭주]켈사이크_강한포효_Roar_노멀"
		{id: 136, msg: '[暴走]凯克·赛克 环形动作'},// "[폭주]켈사이크_루프동작_노멀"
		
		{id: 150, msg: '移动-活跃的'},// "액티브무브_Run_노멀"
		{id: 201, msg: '呼哧呼哧动作'},// "헉헉동작_Groggy_노멀"
		{id: 204, msg: '换人'},// "어그로체인지_aggrochange_노멀"
		{id: 209, msg: '模式提醒'},// "모드알람_ModeAlarm_더미"
		{id: 210, msg: '赞助动作'},// "스폰동작_Spawn_노멀"
		{id: 211, msg: '旋转结束用'},// "회전종료용_ModeAlarm_노멀"
		{id: 302, msg: '随机Buff'}// "무적버프_wait_노멀"
	],
	//            0     1
	CK_TipMsg : ["↑ 进 ↑", "↓ 出 ↓"],
	// 狂气竞技场()
	KQ_BOSS : [
		{id: 108, msg: '一刀(慢)'},    // 101 121 122 連續攻擊 -> 108 一刀兩斷(坦)
		{id: 355, msg: '下巴粉碎'},    // 102 121 103 連續攻擊 -> 355 右手蓄力 -> 114 下巴粉碎
		{id: 135, msg: '一刀(慢)'},    //         104 連續攻擊 -> 135 左手蓄力 -> 130 一刀兩斷
		{id: 111, msg: '眩晕 | 一刀'}, //         104 連續攻擊 -> 111 刀背打擊 -> 130 一刀兩斷
		{id: 112, msg: '后跳 | 一刀'}, //     121 102 連續攻擊 -> 112 後退踢擊 -> 130 一刀兩斷
		{id: 109, msg: '前跳 | 一刀'},         // 109 向下劈擊 -> 402 等待     -> 130 一刀兩斷
		
		{id: 116, msg: '完美格挡'},    // 116 斬擊
		{id: 140, msg: '完美格挡'},    // 140 斬擊
		
		{id: 145, msg: '3圈 | 斩击'},  // 145 重擊斬 139 迴旋砍擊x2 -> 140 斬擊
		{id: 136, msg: '2圈 | 一刀'},  // 136 重擊斬 144 迴旋砍擊x1 -> 130 一刀兩斷
		
		{id: 141, msg: '回旋 | 一刀'}, // 141 破壞氣魄+迴旋砍擊x2 -> 146 114 130
		{id: 146, msg: '下巴 | 一刀'}, // 146 一刀兩斷       -> 114 下巴粉碎 -> 130 一刀兩斷
		{id: 142, msg: '回旋 | 下巴'}, // 142 破壞氣魄+迴旋砍擊x2 -> 143 114 130
		{id: 143, msg: '一刀'},        // 143 一刀兩斷(取消) -> 114 下巴粉碎 -> 130 一刀兩斷
		
		{id: 151, msg: '三斩 | 一刀'}, // 151 149 148三斬 -> 130 一刀兩斷
		{id: 117, msg: '瞬闪(点名)'},  //    117 瞬閃点名 -> 130 一刀兩斷
		{id: 356, msg: '瞬闪(点名)'},  //    356 瞬閃点名 -> 147 一刀兩斷
		{id: 134, msg: '要害(转身)'},  //    134 要害攻擊 -> 147 一刀兩斷
		
		{id: 357, msg: '紫-> 爆炸(远离)'}, // 357 吸收力量 -> 110 起身攻擊 -> 氣斬
		{id: 350, msg: '红-> 甜甜圈'},     // 350 吸收力量                 -> 302 甜甜圈
		
		{id: 351, msg: '破盾!!'},       // 护盾开始 环形爆发
		{id: 401, msg: '30%'}           // 开始
		
		// 105 連續攻擊
		// 106 迴旋砍擊x2
		// 107 憤怒一擊 / 神經劈擊
		// 113 ???
		// 115 瞬閃
		// 118 氣斬
		// 119 瞬閃 + 起身攻擊
		// 120 (右手蓄力)
		// 123 連續攻擊
		// 126 迴旋砍擊x4
		// 127 執念
		// 128 下巴粉碎
		// 129 (右手蓄力)
		// 131 重擊斬 + 迴旋砍擊x2
		// 132 ??? + 一刀兩斷
		// 133 瞬閃 + 氣斬
		// 137 一刀兩斷
		// 138 疾走
		// 150 跑步
		// 352 护盾[不使用]
		// 353 前跳[不使用]
		// 354 护盾破碎[不使用]
		// 360 吸收力量2
		// 361 吸收力量3
	],
	KQ_TipMsg : ["鉴定(就绪)!!"]
}
